tsung/http_simple.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="usi1" />
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="192.168.1.4" port="8080" type="tcp"></server>
  </servers>

  <load>
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="30" unit="second">
     <users interarrival="0.001" unit="second"></users>
   </arrivalphase>
  </load>

 <sessions>
  <session name="http-example" probability="100" type="ts_http">
    <request> <http url="/api/question/1" method="GET" version="1.1"></http> </request>
  </session>
 </sessions>
</tsung>